read_verilog -sv -formal -overwrite {workspace}/uart.v
design -reset-vlog; proc;
write_json {workspace}/netlist/uart_tx.json